diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
//Доработка++
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НоваяГруппаФормыПериод = Элементы.Добавить("ПериодДействия", Тип("ГруппаФормы"));
    НоваяГруппаФормыПериод.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
    НоваяГруппаФормыПериод.Отображение         = ОтображениеОбычнойГруппы.Нет;
    НоваяГруппаФормыПериод.ОтображатьЗаголовок = Ложь;
    НоваяГруппаФормыПериод.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
    
    НоваяГруппаФормыСтоимость = Элементы.Добавить("Стоимость", Тип("ГруппаФормы"));
    НоваяГруппаФормыСтоимость.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
    НоваяГруппаФормыСтоимость.Отображение         = ОтображениеОбычнойГруппы.Нет;
    НоваяГруппаФормыСтоимость.ОтображатьЗаголовок = Ложь;
    НоваяГруппаФормыСтоимость.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
    
    НовыйЭлемент = Элементы.Добавить("ДатаНачалаДействия", Тип("ПолеФормы"), НоваяГруппаФормыПериод);
    НовыйЭлемент.ПутьКДанным    = "Объект.ВКМ_ДатаНачалаДействия";
    НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.Видимость = Ложь;
     
    НовыйЭлемент = Элементы.Добавить("ДатаОкончанияДействия", Тип("ПолеФормы"), НоваяГруппаФормыПериод);
    НовыйЭлемент.ПутьКДанным    = "Объект.ВКМ_ДатаОкончанияДействия";
    НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.Видимость = Ложь;
       
    НовыйЭлемент = Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"), НоваяГруппаФормыСтоимость);
    НовыйЭлемент.ПутьКДанным    = "Объект.ВКМ_АбонентскаяПлата";
    НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.Видимость = Ложь;
   
    НовыйЭлемент = Элементы.Добавить("СтоимостьЧаса", Тип("ПолеФормы"), НоваяГруппаФормыСтоимость);
    НовыйЭлемент.ПутьКДанным    = "Объект.ВКМ_СтоимостьЧаса";
    НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
    НовыйЭлемент.Видимость = Ложь;
    
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ДатаНачалаДействия.Видимость = Истина;
		Элементы.ДатаОкончанияДействия.Видимость = Истина;
		Элементы.АбонентскаяПлата.Видимость = Истина;
		Элементы.СтоимостьЧаса.Видимость = Истина;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ДатаНачалаДействия.Видимость = Истина;
		Элементы.ДатаОкончанияДействия.Видимость = Истина;
		Элементы.АбонентскаяПлата.Видимость = Истина;
		Элементы.СтоимостьЧаса.Видимость = Истина;	
	Иначе
		Элементы.ДатаНачалаДействия.Видимость = Ложь;
		Элементы.ДатаОкончанияДействия.Видимость = Ложь;
		Элементы.АбонентскаяПлата.Видимость = Ложь;
		Элементы.СтоимостьЧаса.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
//Доработка--
